{
  "catalog": [
    {
      "id": 1,
      "title": "Искусственный интеллект и Машинное обучение",
      "list_price": 479,
      "sale_price": 379,
      "img": "./jsonImages/Artificial.webp",
      "author": "Тимур Казанцев",
      "Year": "18 сентября 2020",
      "description": "В этой книге мы расскажем вам об основных понятиях Искусственного интеллекта и Машинного обучения. Вы познакомитесь с основными алгоритмами и моделями, использующимися для решения абсолютно разных задач. Мы научимся предсказывать цены на квартиры, ВВП стран, распределим цветы на разные классы и даже построим собственную нейронную сеть, которая сможет предсказывать, что изображено на рисунке. Для желающих овладеть языком программирования Python, на котором решается большинство задач по машинному обучению, мы пройдем основы программирования на этом языке и научимся использовать его для построения моделей машинного и глубокого обучения."
    },
    {
      "id": 2,
      "title": "Изучаем Python: программирование игр",
      "list_price": 899,
      "sale_price": 799,
      "img": "./jsonImages/python.webp",
      "author": "Эрик Мэтиз",
      "Year": "01 марта 2021",
      "description": "«Изучаем Python» – это самое популярное в мире руководство по языку Python. Вы сможете максимально быстро освоить Python, научитесь писать программы, устранять ошибки и создавать работающие приложения.В первой части книги вы познакомитесь с основными концепциями программирования, такими как переменные, списки, классы и циклы, а простые упражнения познакомят вас с шаблонами чистого кода. Вы узнаете, как делать программы интерактивными и как протестировать код, прежде чем добавлять в проект. Во второй части вы примените новые знания на практике и создадите три проекта: аркадную игру в стиле Space Invaders, визуализацию данных с удобными библиотеками Python и простое веб-приложение, которое можно быстро развернуть онлайн."
    },
    {
      "id": 3,
      "title": "Информатика",
      "list_price": 279,
      "sale_price": 379,
      "img": "./jsonImages/informaton.webp",
      "author": "Наталья Авакян",
      "Year": "31 мая 2021",
      "description": "В пособии в наглядной и доступной форме приводятся сведения по школьному курсу информатики, наглядные таблицы и схемы.Издание окажет помощь старшеклассникам при подготовке к урокам, различным формам текущего и промежуточного контроля, а также к экзаменам."
    },
    {
      "id": 4,
      "title": "C/C++. Программирование на языке высокого уровня",
      "list_price": 699,
      "sale_price": 599,
      "img": "./jsonImages/cplus.webp",
      "author": "Татьяна Александровна Павловская",
      "Year": "03 декабря 2021",
      "description": "Задача этой книги – дать краткое и четкое изложение языка С++ в соответствии со стандартом ISO/IEC 14882. Она предназначена для студентов, изучающих язык «с нуля», но будет полезна и более искушенным в программировании. Цель, которая ставилась при написании книги – дать правильное представление о возможностях языка С++ и способах их применения, толчок к дальнейшему изучению этого и других языков программирования и ключ к пониманию современных объектно-ориентированных технологий.\n\nКонтрольные задания по ключевым темам представлены в 20 вариантах, и автор надеется, что преподаватели оценят проявленную о них заботу."
    },
    {
      "id": 5,
      "title": "Изучаем SQL",
      "list_price": 457,
      "sale_price": 379,
      "img": "./jsonImages/sql.webp",
      "author": "Алан Бьюли",
      "Year": "03 августа 2017",
      "description": "Книга Алана Бьюли, эксперта по языку SQL, – прекрасный учебник для тех, кто еще не знает, но хочет освоить этот язык. Книга не только позволит приобрести начальные знания, но и расскажет о наиболее часто употребляемых мощных средствах языка SQL, используемых опытными программистами. Многие книги, посвященные SQL, грешат скучным изложением основ. Здесь же автор в стиле живого рассказа обсуждает SQL-выражения и блоки, различные типы условий, показывает, как посредством соединения таблиц создавать запросы к нескольким таблицам, рассматривает наборы данных и как они могут взаимодействовать в запросах, демонстрирует встроенные и агрегатные функции, показывает, как и где используются подзапросы. Подробно описаны различные типы соединений таблиц, применение условной логики, работа с транзакциями, индексы и ограничения."
    },
    {
      "id": 6,
      "title": "Программирование на Java для начинающих",
      "list_price": 999,
      "sale_price": 899,
      "img": "./jsonImages/java.webp",
      "author": "Алексей Васильев",
      "Year": "21 декабря 2019",
      "description": "Полный спектр сведений о языке Java с примерами и разбором задач от автора учебников-бестселлеров по языкам программирования Алексея Васильева. С помощью этой книги освоить язык Java сможет каждый желающий – от новичка до специалиста."
    },
    {
      "id": 7,
      "title": "React: современные шаблоны для разработки приложений",
      "list_price": 479,
      "sale_price": 379,
      "img": "./jsonImages/react.webp",
      "author": "Алекс Бэнкс",
      "Year": "02 ноября 2021",
      "description": "Хотите создавать эффективные приложения с помощью React? Тогда эта книга написана для вас. Познакомьтесь лучшими практиками и шаблонами создания современного кода. Вам не потребуются глубокие знания React или функционала JavaScript – достаточно знакомства с принципами работы JavaScript, CSS и HTML. Алекс Бэнкс и Ева Порселло научат вас создавать пользовательские интерфейсы, которые будут динамически отображать изменения без необходимости перезагрузки страницы даже на крупномасштабных сайтах, работающих с огромными массивами данных."
    },
    {
      "id": 8,
      "title": "Автоматизация рутины в Excel VBA",
      "list_price": 369,
      "sale_price": 239,
      "img": "./jsonImages/excel.webp",
      "author": "Виктор Николаевич Шитов",
      "Year": "12 мая 2023",
      "description": "Часто работаете с большим количеством данных? Знаете основные приемы в Excel, но еще не пробовали использовать язык Visual Basic? Тогда самое время разобраться в нем и перестать тратить время на операции, которые можно выполнить одним кликом. С помощью этого руководства вы научитесь правильно использовать синтаксис VBA, сделать тривиальные действия в Excel автоматическими, быстро обрабатывать любые данные и визуализировать их в подходящем формате, легко подстраивать функции VBA под свои нужды и писать любой код самостоятельно."
    },
    {
      "id": 9,
      "title": "HTML, XHTML и CSS",
      "list_price": 479,
      "sale_price": 379,
      "img": "./jsonImages/htmlcss.webp",
      "author": "Игорь Квинт",
      "Year": "27 сентября 2010",
      "description": "Вы хотите создать собственный сайт на просторах Интернета? Причем желательно, чтобы он был красивым, удобным и «неглючным»? Казалось бы, чего проще: существует столько программ – конструкторов сайтов. Однако чтобы создать действительно профессиональный сайт, подобных утилит недостаточно. Вам потребуется знание языков программирования HTML и XHTML, а также каскадных таблиц стилей CSS. И в этом случае книга, которую вы держите в руках, – именно то, что вам необходимо. С ее помощью вы научитесь создавать красиво оформленные, быстрые и профессиональные сайты. С этой книгой ваша страничка никогда не останется незамеченной в Сети!"
    },
    {
      "id": 10,
      "title": "Программирование на PHP в примерах и задачах",
      "list_price": 899,
      "sale_price": 799,
      "img": "./jsonImages/php.webp",
      "author": "Алексей Васильев",
      "Year": "15 сентября 2021",
      "description": "Язык PHP входит в топ самых популярных языков для веб-разработки, но при этом он является еще и одним из самых доступных для самостоятельного изучения языков программирования. С этой книгой освоить PHP может практически каждый, ведь в ней собраны абсолютно все знания, необходимые новичку, – от базовых понятий, истории языка и его семантики до удобно скомпонованных конкретных примеров, позволяющих не только лучше усвоить пройденный материал, но и приступить к самостоятельной реализации проектов на PHP."
    },
    {
      "id": 11,
      "title": "Изучаем Паскаль, создавая игры",
      "list_price": 479,
      "sale_price": 379,
      "img": "./jsonImages/paskal.webp",
      "author": "Татьяна Николаевна Мошникова",
      "Year": "17 марта 2022",
      "description": "Книга рассказывает о программировании на языке Паскаль. В процессе изучения языка вы напишете программы пяти игр. Вы сможете запустить каждую игру и поиграть в нее. В книге вы найдете советы по совершенствованию предложенных программ, задачи для самостоятельного решения, вопросы по изученному материалу. Книга предназначена для школьников, начинающих изучать программирование на языке Паскаль. Книга будет полезна учителям, преподающим программирование."
    },
    {
      "id": 12,
      "title": "Семь языков за семь недель",
      "list_price": 899,
      "sale_price": 799,
      "img": "./jsonImages/language.webp",
      "author": "Брюс А. Тейт",
      "Year": "21 ноября 2017\n",
      "description": "Вместе с семью языками программирования вы исследуете наиболее важные из современных моделей программирования. Вы познакомитесь с динамической типизацией, которая делает языки Ruby, Python и Perl такими гибкими. Постигнете систему прототипов, лежащую в основе языка JavaScript. Увидите, как сопоставление с образцом в языке Prolog сказалось на формировании языков Scala и Erlang. Узнаете, чем функциональное программирование на языке Haskell отличается от программирования на языках семейства Lisp, включая Clojure."
    },
    {
      "id": 13,
      "title": "Как стать программистом с нуля",
      "list_price": 479,
      "sale_price": 379,
      "img": "./jsonImages/kakstat.webp",
      "author": "Александр Ваньков",
      "Year": "20 июня 2020",
      "description": "Книга в простой форме отвечает на вопрос: как стать разработчиком ПО, не имея для этого навыков и соответствующего образования? Сегодня много книг повествует об обучении конкретному языку программирования или технологии, но здесь читатель найдет такое руководство, которое объясняет, что именно делать, чтобы стать IT-специалистом (прежде всего разработчиком) с нуля на любом из языков программирования. Книга не является справочником по конкретному языку программирования, это не учебник по алгоритмам, это книга о методах и инструментах перехода к IT-профессии.\n\n\n"
    },
    {
      "id": 14,
      "title": "Новые возможности JavaScript",
      "list_price": 899,
      "sale_price": 799,
      "img": "./jsonImages/javascript.webp",
      "author": "Ти Краудер",
      "Year": "06 апреля 2023",
      "description": "Перед вами сборник правил написания кода на современном языке JavaScript. На наглядных примерах автор объясняет, как работают последние версии JS, какие приемы в нем можно использовать, чтобы сделать код коротким и чистым, а каких ошибок лучше избегать, чтобы не было багов.\n"
    },
    {
      "id": 15,
      "title": "Хулиномика",
      "list_price": 560,
      "sale_price": 490,
      "img": "./jsonImages/id15.webp",
      "author": "Алексей Марков",
      "Year": "03 декабря 2022",
      "description": "Экономика – это очень скучно. Куча непонятных заумных слов и формул? Кто вам такое сказал? Экономика это интересно и просто! Вы просто не знаете, с каким соусом ее нужно подавать, на какой стороне пережевывать и долго ли жевать. Все базовые знания о ней и много больше вы получите из книги \"Хулиномика\", а также найдете немало интересных ответов на вопросы по типу: • Как появилась биржа, и почему в России она круче? • Кого облапошила английская королева? • Как говнюки становятся директорами? • Что такое акции и что с их прелестью можно делать? • Как может Павел Дуров купить \"Гугл\" целиком? • Зачем ЦРУ запрещало шорты? • Почему только ламантины и гадалки предсказывают рынок? У Алексея Маркова есть для вас чит-коды. Возьмите в руки книгу, перелистывайте страницы и впитывайте!"
    },
    {
      "id": 16,
      "title": "Земля",
      "list_price": 1090,
      "sale_price": 1180,
      "img": "./jsonImages/id16.webp",
      "author": "Е.Г. Ананьева, С.С. Мирнова",
      "Year": "18 сентября 2020",
      "description": "Как необъятна и прекрасна наша планета! Она полна витиеватых цветных узоров, если наблюдать за ней из окна иллюминатора, а также самых неожиданных мест и захватывающих дух видов, если не переставать путешествовать по ней, открывая для себя все новые и новые локации. Действительно, Земля — это наш дом, одновременно родной и неизведанный. Сложно представить, как много тайн и загадок хранят в себе малоизученные ее пространства. Эта прекрасная энциклопедия — настоящий подарок для юных исследователей и острых умов, жадных до удивительных открытий и новых знаний. Великолепная энциклопедия позволит по-новому взглянуть на привычные явления и научит рассматривать чудеса даже в повседневных реалиях. «Земля. Полная энциклопедия» от Е. Г. Ананьевой и С.С. Мирновой станет прекрасным подарком школьникам и их родителям, а также замечательным помощником в познании этого мира. Книга ответит на самые интересные вопросы, которые касаются нашей родной планеты, а также ее удивительных просторов и головокружительных феноменов. Почему одни районы Земли истощены нещадной засухой, а другие навеки скованны хрустальным льдом? Почему закатные лучи вечером окрашивают небесный свод в багрово-персиковые тона, а на утро он — цвета бирюзы? Из чего состоит шаровая молния? Почему появляется гипнотизирующее мерцание полярных ночей? Что можно встретить внутри ураганных ветров? На эти и многие другие вопросы ответит восхитительное издание от Е. Г. Ананьевой и С.С. Мирновой."
    },
    {
      "id": 17,
      "title": "Стратегия",
      "list_price": 880,
      "sale_price": 990,
      "img": "./jsonImages/id17.webp",
      "author": "Коллектив авторов HBR",
      "Year": "03 августа 2023",
      "description": "Harvard Business Review — главный деловой журнал в мире. С гордостью представляем новый выпуск серии «HBR: 10 лучших статей», посвященный проблемам стратегического планирования бизнеса. Если ваша компания тратит массу энергии на стратегическое планирование, результатами которого вы недовольны, то это книга для вас. Из сотен статей HBR, посвященных планированию, мы выбрали самые полезные с практической точки зрения. Из них вы узнаете, какие конкурентные силы должны учитываться при разработке стратегии компании; какие показатели важно принимать во внимание, а какие — нет; кому стоит делегировать принятие решений. И самое главное: как претворить великолепную стратегию в блестящие результаты."
    },
    {
      "id": 18,
      "title": "Деньги. Мастер игры",
      "list_price": 2180,
      "sale_price": 2070,
      "img": "./jsonImages/id18.webp",
      "author": "Энтони Роббинс",
      "Year": "10 марта 2021",
      "description": "Наконец-то вышла книга, которую давно ждали! Основываясь на обширных исследованиях и личных интервью с более чем 50 легендарными финансистами мира, знаменитый Тони Роббинс разработал простой план из 7 шагов, который любой человек может использовать для достижения материального благосостояния. Даже самые сложные финансовые концепции Тони излагает простым и понятным языком, сопровождая их реальными историями из жизни. Вместе с читателями самого разного уровня достатка он проходит все шаги, ведущие к финансовой свободе, попутно развенчивая мифы, мешающие людям стать богатыми. Эта книга поможет вам научиться мыслить как 50 самых успешных инвесторов мира, избавиться от материальных проблем и добиться финансовой безопасности, создать источники гарантированных доходов, которые не иссякнут, пока вы живы."
    }
  ]
}

